#-*- coding:UTF-8 -*-
#===================================================
# author	: Tmark
# date 		: 2017-9-22
# module	: Define.LogDefine
#===================================================
# 通常不使用，补位
RootLogger		=	0

#====================================================
# 系统日志类型
#====================================================
ErrorLogger			=	-1
WarningLogger		=	-2

#====================================================
# 消息日志类型
#====================================================
WebRequestLogger	=	1				# web请求消息日志

#====================================================
# 日志类型路由（映射或者用于日志类型合法性检测）
#====================================================
LoggerRoute = {
			# 补位
			RootLogger			:	None,
			
			# 系统日志类型
			ErrorLogger			:	"error",
			WarningLogger		:	"warning",
			
			# 消息日志类型
			WebRequestLogger	:	"webRequest"
			}
